{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_1","layers":[{"class_name":"DepthwiseConv2D","config":{"kernel_size":[21,21],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"depthwise_conv2d_DepthwiseConv2D1","trainable":true,"batch_input_shape":[null,136,296,3],"dtype":"float32","depth_multiplier":3,"depthwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"depthwise_regularizer":null,"depthwise_constraint":null}},{"class_name":"MaxPooling2D","config":{"pool_size":[2,2],"padding":"valid","strides":[2,2],"data_format":"channels_last","name":"max_pooling2d_MaxPooling2D3","trainable":true}},{"class_name":"DepthwiseConv2D","config":{"kernel_size":[7,7],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"depthwise_conv2d_DepthwiseConv2D2","trainable":true,"depth_multiplier":3,"depthwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"depthwise_regularizer":null,"depthwise_constraint":null}},{"class_name":"MaxPooling2D","config":{"pool_size":[2,2],"padding":"valid","strides":[2,2],"data_format":"channels_last","name":"max_pooling2d_MaxPooling2D4","trainable":true}},{"class_name":"DepthwiseConv2D","config":{"kernel_size":[3,3],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"depthwise_conv2d_DepthwiseConv2D3","trainable":true,"depth_multiplier":3,"depthwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"depthwise_regularizer":null,"depthwise_constraint":null}},{"class_name":"Flatten","config":{"name":"flatten_Flatten3","trainable":true}},{"class_name":"Dense","config":{"units":128,"activation":"leaky_re_lu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.01}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7","trainable":true}},{"class_name":"Dense","config":{"units":21,"activation":"leaky_re_lu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense8","trainable":true}}]},"keras_version":"tfjs-layers 4.19.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"depthwise_conv2d_DepthwiseConv2D1/depthwise_kernel","shape":[21,21,3,3],"dtype":"float32"},{"name":"depthwise_conv2d_DepthwiseConv2D1/bias","shape":[9],"dtype":"float32"},{"name":"depthwise_conv2d_DepthwiseConv2D2/depthwise_kernel","shape":[7,7,9,3],"dtype":"float32"},{"name":"depthwise_conv2d_DepthwiseConv2D2/bias","shape":[27],"dtype":"float32"},{"name":"depthwise_conv2d_DepthwiseConv2D3/depthwise_kernel","shape":[3,3,27,3],"dtype":"float32"},{"name":"depthwise_conv2d_DepthwiseConv2D3/bias","shape":[81],"dtype":"float32"},{"name":"dense_Dense7/kernel","shape":[124416,128],"dtype":"float32"},{"name":"dense_Dense7/bias","shape":[128],"dtype":"float32"},{"name":"dense_Dense8/kernel","shape":[128,21],"dtype":"float32"},{"name":"dense_Dense8/bias","shape":[21],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.19.0","convertedBy":null}