{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_1","layers":[{"class_name":"Conv2D","config":{"filters":32,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_in","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[2,2],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D5","trainable":true,"batch_input_shape":[null,136,296,3],"dtype":"float32"}},{"class_name":"DepthwiseConv2D","config":{"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"depthwise_conv2d_DepthwiseConv2D1","trainable":true,"depth_multiplier":1,"depthwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"depthwise_regularizer":null,"depthwise_constraint":null}},{"class_name":"Conv2D","config":{"filters":64,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_in","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D6","trainable":true}},{"class_name":"DepthwiseConv2D","config":{"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"depthwise_conv2d_DepthwiseConv2D2","trainable":true,"depth_multiplier":1,"depthwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"depthwise_regularizer":null,"depthwise_constraint":null}},{"class_name":"Conv2D","config":{"filters":512,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_in","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D7","trainable":true}},{"class_name":"DepthwiseConv2D","config":{"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"depthwise_conv2d_DepthwiseConv2D3","trainable":true,"depth_multiplier":1,"depthwise_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"depthwise_regularizer":null,"depthwise_constraint":null}},{"class_name":"Conv2D","config":{"filters":1024,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_in","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[1,1],"strides":[1,1],"padding":"valid","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D8","trainable":true}},{"class_name":"GlobalAveragePooling2D","config":{"data_format":"channels_last","name":"global_average_pooling2d_GlobalAveragePooling2D1","trainable":true}},{"class_name":"Dense","config":{"units":21,"activation":"leaky_re_lu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_in","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7","trainable":true}}]},"keras_version":"tfjs-layers 4.19.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"conv2d_Conv2D5/kernel","shape":[3,3,3,32],"dtype":"float32"},{"name":"conv2d_Conv2D5/bias","shape":[32],"dtype":"float32"},{"name":"depthwise_conv2d_DepthwiseConv2D1/depthwise_kernel","shape":[3,3,32,1],"dtype":"float32"},{"name":"depthwise_conv2d_DepthwiseConv2D1/bias","shape":[32],"dtype":"float32"},{"name":"conv2d_Conv2D6/kernel","shape":[1,1,32,64],"dtype":"float32"},{"name":"conv2d_Conv2D6/bias","shape":[64],"dtype":"float32"},{"name":"depthwise_conv2d_DepthwiseConv2D2/depthwise_kernel","shape":[3,3,64,1],"dtype":"float32"},{"name":"depthwise_conv2d_DepthwiseConv2D2/bias","shape":[64],"dtype":"float32"},{"name":"conv2d_Conv2D7/kernel","shape":[1,1,64,512],"dtype":"float32"},{"name":"conv2d_Conv2D7/bias","shape":[512],"dtype":"float32"},{"name":"depthwise_conv2d_DepthwiseConv2D3/depthwise_kernel","shape":[3,3,512,1],"dtype":"float32"},{"name":"depthwise_conv2d_DepthwiseConv2D3/bias","shape":[512],"dtype":"float32"},{"name":"conv2d_Conv2D8/kernel","shape":[1,1,512,1024],"dtype":"float32"},{"name":"conv2d_Conv2D8/bias","shape":[1024],"dtype":"float32"},{"name":"dense_Dense7/kernel","shape":[1024,21],"dtype":"float32"},{"name":"dense_Dense7/bias","shape":[21],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.19.0","convertedBy":null}